// app/page1/page.jsx
import '../styles/page.css';

export default function Page8() {
    return (
        <div>
            <h1>Flow</h1>
            <p>Dart – это язык программирования, разработанный Google, первоначально предназначенный для создания фронтенд и бэкэнд приложений. </p>
            <p>Dart разрабатывался как язык с динамической типизацией, со временем в него были добавлены возможности статической типизации, поэтому он поддерживает как статическую, так и динамическую типизации. С появлением в языке функции sound null safety, Dart улучшил систему типизации для предотвращения ошибок связанных с null. Данная функция гарантирует, что переменные не могут содержать null, если это не указано явно. </p>
            <p>Рассмотрим несколько примеров реализации статической типизации в Dart.</p>
            <h3>Пример кода</h3>
            <p></p>
            <pre>
                <code>
                    {``}
                </code>
            </pre>
            <h3>Пример кода</h3>
            <p></p>
            <pre>
                <code>
                    {``}
                </code>
            </pre>
            <h3>Пример кода</h3>
            <p></p>
            <pre>
                <code>
                    {``}
                </code>
            </pre>
            <h3>Пример кода</h3>
            <p></p>
            <pre>
                <code>
                    {``}
                </code>
            </pre>
            <h3>Пример кода</h3>
            <p></p>
            <pre>
                <code>
                    {``}
                </code>
            </pre>
        </div>
    );
}